# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.10-p004_1 on Tue Apr 22 00:00:19 +07 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design aes_top

create_clock -name "CLK" -period 50.0 -waveform {0.0 25.0} [get_ports clk]
create_clock -name "CLK2" -period 50.0 -waveform {0.0 25.0} [get_ports sck]
set_clock_transition -min 0.3 [get_clocks CLK]
set_clock_transition -max 0.5 [get_clocks CLK]
set_clock_transition -min 0.3 [get_clocks CLK2]
set_clock_transition -max 0.5 [get_clocks CLK2]
set_load -pin_load 0.0022 [get_ports miso]
set_clock_groups -name "clock_groups_CLK_to_CLK2" -allow_paths -asynchronous -group [get_clocks CLK] -group [get_clocks CLK2]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK2] -add_delay 10.0 [get_ports mosi]
set_input_delay -clock [get_clocks CLK2] -add_delay 10.0 [get_ports ss]
set_output_delay -clock [get_clocks CLK2] -add_delay 10.0 [get_ports miso]
set_driving_cell -lib_cell CLKBUFHDV32 -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports clk]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports rst]
set_driving_cell -lib_cell CLKBUFHDV32 -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports sck]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports mosi]
set_driving_cell -lib_cell BUFHDV8RD -library scc013ull_hd_rvt_ff_v1p32_-40c_basic -pin "Z" [get_ports ss]
set_ideal_network -no_propagate [get_nets clk]
set_ideal_network -no_propagate [get_nets sck]
set_wire_load_mode "enclosed"
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDGRNQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRNQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDRSNQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDSNQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDXHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDXHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SDXHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SEDRNQNHDV8]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDRNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDRNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDRNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDRSNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDRSNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDRSNHDV4]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDSNHDV0]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDSNHDV2]
set_dont_use true [get_lib_cells scc013ull_hd_rvt_ff_v1p32_-40c_basic/SNDSNHDV4]
set_clock_latency  1.0 [get_clocks CLK]
set_clock_latency -source -max -late 1.25 [get_clocks CLK]
set_clock_latency -source -max -early 1.0 [get_clocks CLK]
set_clock_latency -source -min -early 0.5 [get_clocks CLK]
set_clock_latency -source -min -late 0.75 [get_clocks CLK]
set_clock_uncertainty -setup 1.0 [get_clocks CLK]
set_clock_uncertainty -hold 0.25 [get_clocks CLK]
set_clock_latency  1.0 [get_clocks CLK2]
set_clock_latency -source -max -late 1.25 [get_clocks CLK2]
set_clock_latency -source -max -early 1.0 [get_clocks CLK2]
set_clock_latency -source -min -early 0.5 [get_clocks CLK2]
set_clock_latency -source -min -late 0.75 [get_clocks CLK2]
set_clock_uncertainty -setup 1.0 [get_clocks CLK2]
set_clock_uncertainty -hold 0.25 [get_clocks CLK2]
